<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Integrated Project: Maji Ndogo Part 3
© ExploreAI Academy

## Maji Ndogo: From analysis to action
# Weaving the data threads of Maji Ndogo's narrative

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `mdd_water_services` database.




### Subject: Results of audit on Maji Ndogo water project

For clarity, in this specific audit, our objective was to assess the integrity, and accuracy of the data stored in the database. Auditing a database
involves verifying that the data it contains is both accurate and has not been tampered with, thereby ensuring that the information can be relied
upon for decision-making and governance.

I am pleased to report that the audit is now complete. After a rigorous examination of the database's records, as well as the procedures in place for
data entry and modification, we can confirm that the vast majority of the data aligns with the principles of good governance and data-driven
decision-making that you have so vigorously championed.

## ERD in MySql

Hey! It's been a while! I hope you are ready to get stuck in. We got back the auditor's report, so we need to compare their results to ours.

To integrate the auditor's report, we will need to access many of the tables in the database, so it is important to understand the database structure.
To do this we really need to understand the relationships first, so we know where to pull information from.

### Note that
the visits table is the central table. location_id, source_id and assigned_employee_id are primary keys in their respective tables,
but are all foreign keys in visits. These are mostly dsone-to-many relationships. Let's think some of these through so we are sure this is correct.

The visits table logs all the times we've been to different places, and we can see that some locations have been visited multiple times. On the
other hand, the location table has all the specifics about each place we've been but it only includes each location once. So, it's a one-to-many
relationship: for each unique location in the location table, there might be many corresponding records in the visits table detailing all the
different times we went there.

Let's look at the relationship between the visits and water_quality tables. For every entry in the visits table, there should be one unique
corresponding record in the water_quality table. This means each visit recorded is associated with a specific water quality score, ensuring a
one-to-one relationship between the visits and water_quality tables.

But if we look at the ERD, it shows a many-to-one relationship. This does not agree with our thinking. Errors like these can cause problems, so let's
fix that.

We should normally be careful making a change like this. First you should check that record_id is unique for both tables, and are indeed
one-to-one but I did that.

## Connecting to our MySQL database

Using our `Access_to_Basic_Services` table created in MySQL Workbench, we want to answer some questions on the range of our dataset. We can apply the same queries in MySQL Workbench and in this notebook if we connect to our MySQL server. Since we have a MySQL database, we can connect to it using mysql and pymysql.

In [ ]:
# To display all row in ouputs
%config SqlMagic.displaylimit = None

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://Explore:712370SS@localhost:3306/mdd_water_services

Connecting to 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

#### Integrating the Auditor's report
Ok, I have a .csv file of the auditor's results. I loaded it into MYSQL.

In [ ]:
%%sql
-- To make sure we have the same names, use this query to create the table first, then Import the CSV file:
 
CREATE TABLE `auditor_report` (
         `location_id` VARCHAR(32),
         `type_of_water_source` VARCHAR(64),
         `true_water_source_score` int DEFAULT NULL,
         `statements` VARCHAR(255)
           )     
-- I did it in mysql and import the csv file called auditor_report

Wow! First off, it looks like we have 1620 records, or sites that they re-visited. I see a location_id, type of water source at that location, and the
quality score of the water source, that is now independently measured. Our auditor also investigated each site a bit by speaking to a few locals.
Their statements are also captured in his results.

We need to tackle a couple of questions here.
1. Is there a difference in the scores?
2. If so, are there patterns?

For the first question, we will have to compare the quality scores in the water_quality table to the auditor's scores. The auditor_report table
used location_id, but the quality scores table only has a record_id we can use. The visits table links location_id and record_id, so we
can link the auditor_report table and water_quality using the visits table.

In [3]:
%%sql
-- So first, grab the location_id and true_water_source_score columns from auditor_report. PAGE(7)

SELECT
     location_id,
	 true_water_source_score
FROM
    mdd_water_services.auditor_report

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

1620 rows affected.

+-------------+-------------------------+
| location_id | true_water_source_score |
+-------------+-------------------------+
|  SoRu34980  |            1            |
|  AkRu08112  |            3            |
|  AkLu02044  |            0            |
|  AkHa00421  |            3            |
|  SoRu35221  |            0            |
|  HaAm16170  |            1            |
|  AkRu04812  |            3            |
|  AkRu08304  |            3            |
|  AkRu05107  |            2            |
|  AkRu05215  |            3            |
+-------------+-------------------------+
Truncated to displaylimit of 10.

In [4]:
%%sql

-- Now, we join the visits table to the auditor_report table.
-- Make sure to grab subjective_quality_score, record_id and location_id.  PAGE(8)
SELECT
     A.location_id AS audit_location,
	 A.true_water_source_score,
     V.location_id AS visit_location,
     V.record_id
FROM
    mdd_water_services.auditor_report AS A
JOIN 
   mdd_water_services.visits AS V
ON
    V.location_id = A.location_id

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

2698 rows affected.

+----------------+-------------------------+----------------+-----------+
| audit_location | true_water_source_score | visit_location | record_id |
+----------------+-------------------------+----------------+-----------+
|   SoRu34980    |            1            |   SoRu34980    |    5185   |
|   AkRu08112    |            3            |   AkRu08112    |   59367   |
|   AkLu02044    |            0            |   AkLu02044    |   37379   |
|   AkHa00421    |            3            |   AkHa00421    |   51627   |
|   SoRu35221    |            0            |   SoRu35221    |   28758   |
|   HaAm16170    |            1            |   HaAm16170    |   31048   |
|   AkRu04812    |            3            |   AkRu04812    |    1513   |
|   AkRu08304    |            3            |   AkRu08304    |    1218   |
|   AkRu05107    |            2            |   AkRu05107    |    8322   |
|   AkRu05215    |            3            |   AkRu05215    |   21160   |
+----------------+-------------------------+----------------+-----------+
Truncated to displaylimit of 10.

In [5]:
%%sql
-- Now that we have the record_id for each location, 
-- We our next step is to retrieve the corresponding scores from the water_quality table. 
-- are particularly interested in the subjective_quality_score. To do this,
-- we'll JOIN the visits table and the water_quality table, using the
-- record_id as the connecting key.   PAGE(9)

SELECT
     V.location_id AS audit_location,
	 A.true_water_source_score,
     WAT_Q.record_id AS visit_location,
     V.record_id,
     WAT_Q.subjective_quality_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

2698 rows affected.

+----------------+-------------------------+----------------+-----------+--------------------------+
| audit_location | true_water_source_score | visit_location | record_id | subjective_quality_score |
+----------------+-------------------------+----------------+-----------+--------------------------+
|   SoRu34980    |            1            |      5185      |    5185   |            1             |
|   AkRu08112    |            3            |     59367      |   59367   |            3             |
|   AkLu02044    |            0            |     37379      |   37379   |            0             |
|   AkHa00421    |            3            |     51627      |   51627   |            3             |
|   SoRu35221    |            0            |     28758      |   28758   |            0             |
|   HaAm16170    |            1            |     31048      |   31048   |            1             |
|   AkRu04812    |            3            |      1513      |    1513   |            3             |
|   AkRu08304    |            3            |      1218      |    1218   |            3             |
|   AkRu05107    |            2            |      8322      |    8322   |            2             |
|   AkRu05215    |            3            |     21160      |   21160   |            10            |
+----------------+-------------------------+----------------+-----------+--------------------------+
Truncated to displaylimit of 10.

In [6]:
%%sql

-- It doesn't matter if your columns are in a different format,
-- because we are about to clean this up a bit. Since it is a duplicate, we can drop one of the location_id columns.
--  Let's leave record_id and rename the scores to surveyor_score and auditor_score to make it clear which scores
-- we're looking at in the results set.   PAGE(10)

SELECT
     V.location_id ,
	 V.record_id,                                          	 
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

2698 rows affected.

+-------------+-----------+---------------+----------------+
| location_id | record_id | auditor_score | employee_score |
+-------------+-----------+---------------+----------------+
|  SoRu34980  |    5185   |       1       |       1        |
|  AkRu08112  |   59367   |       3       |       3        |
|  AkLu02044  |   37379   |       0       |       0        |
|  AkHa00421  |   51627   |       3       |       3        |
|  SoRu35221  |   28758   |       0       |       0        |
|  HaAm16170  |   31048   |       1       |       1        |
|  AkRu04812  |    1513   |       3       |       3        |
|  AkRu08304  |    1218   |       3       |       3        |
|  AkRu05107  |    8322   |       2       |       2        |
|  AkRu05215  |   21160   |       3       |       10       |
+-------------+-----------+---------------+----------------+
Truncated to displaylimit of 10.

Since were joining 1620 rows of data, we want to keep track of the number of rows we get each time we run a query. We can either set the
maximum number of rows we want from "Limit to 1000 rows" to a larger number like 10000, or we can force SQL to give us all of the results, using
LIMIT 10000.

In [7]:
%%sql

-- Ok, let's analyse! A good starting point is to check if the auditor's and exployees' scores agree.
-- There are many ways to do it. We can have a WHERE clause and check if surveyor_score = auditor_score,
-- or we can subtract the two scores and check if the result is 0.  PAGE(11)
 SELECT
     V.location_id ,
	 V.record_id,                                          	 
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score,
     (true_water_source_score - subjective_quality_score) AS RESULT_SCORE
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
WHERE
    A.true_water_source_score = WAT_Q.subjective_quality_score
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

2505 rows affected.

+-------------+-----------+---------------+----------------+--------------+
| location_id | record_id | auditor_score | employee_score | RESULT_SCORE |
+-------------+-----------+---------------+----------------+--------------+
|  SoRu34980  |    5185   |       1       |       1        |      0       |
|  AkRu08112  |   59367   |       3       |       3        |      0       |
|  AkLu02044  |   37379   |       0       |       0        |      0       |
|  AkHa00421  |   51627   |       3       |       3        |      0       |
|  SoRu35221  |   28758   |       0       |       0        |      0       |
|  HaAm16170  |   31048   |       1       |       1        |      0       |
|  AkRu04812  |    1513   |       3       |       3        |      0       |
|  AkRu08304  |    1218   |       3       |       3        |      0       |
|  AkRu05107  |    8322   |       2       |       2        |      0       |
|  HaDe16541  |   13070   |       2       |       2        |      0       |
+-------------+-----------+---------------+----------------+--------------+
Truncated to displaylimit of 10.

In [8]:
%%sql
-- I got 2505 rows right? Some of the locations were visited multiple times, so these records are duplicated here.
-- To fix it, we set visits.visit_count
-- = 1 in the WHERE clause. Make sure you reference the alias you used for visits in the join. PAGE(11)
 SELECT
     V.location_id ,
	 V.record_id,                                          	 
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score,
     (true_water_source_score - subjective_quality_score) AS RESULT_SCORE
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1
LIMIT 10000 
-- But that means that 102 records are incorrect. 
-- So let's look at those. I can do it by adding one character in the last query!

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+-----------+---------------+----------------+--------------+
| location_id | record_id | auditor_score | employee_score | RESULT_SCORE |
+-------------+-----------+---------------+----------------+--------------+
|  AkRu05215  |   21160   |       3       |       10       |      -7      |
|  KiRu29290  |    7938   |       3       |       10       |      -7      |
|  KiHa22748  |   43140   |       9       |       10       |      -1      |
|  SoRu37841  |   18495   |       6       |       10       |      -4      |
|  KiRu27884  |   33931   |       1       |       10       |      -9      |
|  KiZu31170  |   17950   |       9       |       10       |      -1      |
|  KiZu31370  |   36864   |       3       |       10       |      -7      |
|  AkRu06495  |   45924   |       2       |       10       |      -8      |
|  HaRu17528  |   30524   |       1       |       10       |      -9      |
|  SoRu38331  |   13192   |       3       |       10       |      -7      |
+-------------+-----------+---------------+----------------+--------------+
Truncated to displaylimit of 10.

With the duplicates removed I now get 1518. What does this mean considering the auditor visited 1620 sites?
I think that is an excellent result. 1518/1620 = 94% of the records the auditor checked were correct!!

In [9]:
%%sql

-- So, to do this, we need to grab the type_of_water_source column from the water_source table and call it survey_source, 
-- using the source_id column to JOIN. 
-- Also select the type_of_water_source from the auditor_report table,
-- and call it auditor_source.   PAGE(13)
 
 SELECT
     V.location_id ,
	 A.type_of_water_source AS auditor_source,
     water_source.type_of_water_source AS survey_source,
	 V.record_id,                                          	 
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    mdd_water_services.water_source
ON
   water_source.source_id = V.source_id
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+--------------------+--------------------+-----------+---------------+----------------+
| location_id |   auditor_source   |   survey_source    | record_id | auditor_score | employee_score |
+-------------+--------------------+--------------------+-----------+---------------+----------------+
|  AkRu05215  |        well        |        well        |   21160   |       3       |       10       |
|  KiRu29290  |     shared_tap     |     shared_tap     |    7938   |       3       |       10       |
|  KiHa22748  | tap_in_home_broken | tap_in_home_broken |   43140   |       9       |       10       |
|  SoRu37841  |     shared_tap     |     shared_tap     |   18495   |       6       |       10       |
|  KiRu27884  |        well        |        well        |   33931   |       1       |       10       |
|  KiZu31170  | tap_in_home_broken | tap_in_home_broken |   17950   |       9       |       10       |
|  KiZu31370  |     shared_tap     |     shared_tap     |   36864   |       3       |       10       |
|  AkRu06495  |        well        |        well        |   45924   |       2       |       10       |
|  HaRu17528  |        well        |        well        |   30524   |       1       |       10       |
|  SoRu38331  |     shared_tap     |     shared_tap     |   13192   |       3       |       10       |
+-------------+--------------------+--------------------+-----------+---------------+----------------+
Truncated to displaylimit of 10.

So what I can see is that the types of sources look the same! So even though the scores are wrong, the integrity of the type_of_water_source
data we analysed last time is not affected.

Once you're done, remove the columns and JOIN statement for water_sources again.
#### Linking records to employees
Next up, let's look at where these errors may have come from. At some of the locations, employees assigned scores incorrectly, and those records
ended up in this results set.

I think there are two reasons this can happen.
1. These workers are all humans and make mistakes so this is expected.
2. Unfortunately, the alternative is that someone assigned scores incorrectly on purpose!

In [10]:
%%sql

-- In either case, the employees are the source of the errors, 
-- so let's JOIN the assigned_employee_id for all the people on our list from the visits
-- table to our query. Remember, our query shows the shows the 102 incorrect records,
-- so when we join the employee data, we can see which
-- employees made these incorrect records.  PAGE(14)
 SELECT
     V.location_id ,
	 V.record_id, 
     A.type_of_water_source AS auditor_source,
     V.assigned_employee_id AS assigned_employee_id,
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    mdd_water_services.water_source
ON
   water_source.source_id = V.source_id
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+-----------+--------------------+----------------------+---------------+----------------+
| location_id | record_id |   auditor_source   | assigned_employee_id | auditor_score | employee_score |
+-------------+-----------+--------------------+----------------------+---------------+----------------+
|  AkRu05215  |   21160   |        well        |          34          |       3       |       10       |
|  KiRu29290  |    7938   |     shared_tap     |          1           |       3       |       10       |
|  KiHa22748  |   43140   | tap_in_home_broken |          1           |       9       |       10       |
|  SoRu37841  |   18495   |     shared_tap     |          34          |       6       |       10       |
|  KiRu27884  |   33931   |        well        |          1           |       1       |       10       |
|  KiZu31170  |   17950   | tap_in_home_broken |          5           |       9       |       10       |
|  KiZu31370  |   36864   |     shared_tap     |          48          |       3       |       10       |
|  AkRu06495  |   45924   |        well        |          1           |       2       |       10       |
|  HaRu17528  |   30524   |        well        |          18          |       1       |       10       |
|  SoRu38331  |   13192   |     shared_tap     |          5           |       3       |       10       |
+-------------+-----------+--------------------+----------------------+---------------+----------------+
Truncated to displaylimit of 10.

In [11]:
%%sql

-- So now we can link the incorrect records to the employees who recorded them.
-- The ID's don't help us to identify them. We have employees' names
-- stored along with their IDs, 
-- so let's fetch their names from the employees table instead of the ID's.  PAGE(15)
 SELECT
     V.location_id,
	 V.record_id, 
     A.type_of_water_source AS auditor_source,
     employee.employee_name AS employee_name,
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    mdd_water_services.water_source
ON
   water_source.source_id = V.source_id
JOIN 
   mdd_water_services.employee AS employee
ON
  V.assigned_employee_id = employee.assigned_employee_id
  
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+-----------+--------------------+----------------+---------------+----------------+
| location_id | record_id |   auditor_source   | employee_name  | auditor_score | employee_score |
+-------------+-----------+--------------------+----------------+---------------+----------------+
|  AkRu05215  |   21160   |        well        |   Rudo Imani   |       3       |       10       |
|  KiRu29290  |    7938   |     shared_tap     |  Bello Azibo   |       3       |       10       |
|  KiHa22748  |   43140   | tap_in_home_broken |  Bello Azibo   |       9       |       10       |
|  SoRu37841  |   18495   |     shared_tap     |   Rudo Imani   |       6       |       10       |
|  KiRu27884  |   33931   |        well        |  Bello Azibo   |       1       |       10       |
|  KiZu31170  |   17950   | tap_in_home_broken | Zuriel Matembo |       9       |       10       |
|  KiZu31370  |   36864   |     shared_tap     | Yewande Ebele  |       3       |       10       |
|  AkRu06495  |   45924   |        well        |  Bello Azibo   |       2       |       10       |
|  HaRu17528  |   30524   |        well        | Jengo Tumaini  |       1       |       10       |
|  SoRu38331  |   13192   |     shared_tap     | Zuriel Matembo |       3       |       10       |
+-------------+-----------+--------------------+----------------+---------------+----------------+
Truncated to displaylimit of 10.

Well this query is massive and complex, so maybe it is a good idea to save this as a CTE, so when we do more analysis, we can just call that CTE
like it was a table. Call it something like Incorrect_records. Once you are done, check if this query SELECT * FROM Incorrect_records, gets
the same table back.

Now that we defined Incorrect_records, we can query it like any other table.

Let's first get a unique list of employees from this table. Think back to the start of your SQL journey to answer this one. I got 17 employees.

In [12]:
%%sql

-- Well this query is massive and complex, so maybe it is a good idea to save this as a CTE, 
-- so when we do more analysis, we can just call that CTE
-- like it was a table. Call it something like Incorrect_records. Once you are done, 
-- check if this query SELECT * FROM Incorrect_records, gets
-- the same table back.  PAGE(16)

WITH Incorrect_records AS(
 SELECT
     V.location_id ,
	 V.record_id, 
     A.type_of_water_source AS auditor_source,
     employee.employee_name AS employee_name,
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    mdd_water_services.water_source
ON
   water_source.source_id = V.source_id
JOIN 
   mdd_water_services.employee AS employee
ON
  V.assigned_employee_id = employee.assigned_employee_id
  
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1)

SELECT
      *
FROM
    Incorrect_records
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+-----------+--------------------+----------------+---------------+----------------+
| location_id | record_id |   auditor_source   | employee_name  | auditor_score | employee_score |
+-------------+-----------+--------------------+----------------+---------------+----------------+
|  AkRu05215  |   21160   |        well        |   Rudo Imani   |       3       |       10       |
|  KiRu29290  |    7938   |     shared_tap     |  Bello Azibo   |       3       |       10       |
|  KiHa22748  |   43140   | tap_in_home_broken |  Bello Azibo   |       9       |       10       |
|  SoRu37841  |   18495   |     shared_tap     |   Rudo Imani   |       6       |       10       |
|  KiRu27884  |   33931   |        well        |  Bello Azibo   |       1       |       10       |
|  KiZu31170  |   17950   | tap_in_home_broken | Zuriel Matembo |       9       |       10       |
|  KiZu31370  |   36864   |     shared_tap     | Yewande Ebele  |       3       |       10       |
|  AkRu06495  |   45924   |        well        |  Bello Azibo   |       2       |       10       |
|  HaRu17528  |   30524   |        well        | Jengo Tumaini  |       1       |       10       |
|  SoRu38331  |   13192   |     shared_tap     | Zuriel Matembo |       3       |       10       |
+-------------+-----------+--------------------+----------------+---------------+----------------+
Truncated to displaylimit of 10.

In [13]:
%%sql
-- Next, let's try to calculate how many mistakes each employee made. 
-- So basically we want to count how many times their name is in
-- Incorrect_records list, and then group them by name, right?

WITH Incorrect_records AS(
 SELECT
     V.location_id ,
	 V.record_id, 
     A.type_of_water_source AS auditor_source,
     employee.employee_name AS employee_name,
     A.true_water_source_score AS auditor_score,
     WAT_Q.subjective_quality_score AS employee_score
FROM
    mdd_water_services.visits AS V
JOIN 
   mdd_water_services.water_quality AS WAT_Q
ON
    V.record_id = WAT_Q.record_id
JOIN 
	mdd_water_services.auditor_report AS A
ON 
    V.location_id = A.location_id 
JOIN
    mdd_water_services.water_source
ON
   water_source.source_id = V.source_id
JOIN 
   mdd_water_services.employee AS employee
ON
  V.assigned_employee_id = employee.assigned_employee_id
  
WHERE
    A.true_water_source_score  <> WAT_Q.subjective_quality_score
    AND V.visit_count = 1)

SELECT DISTINCT 
      employee_name,
      count(employee_name) OVER (PARTITION BY employee_name) AS number_of_mistakes
FROM
    Incorrect_records
LIMIT 10000

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

17 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
|  Deka Osumare  |         1          |
|  Enitan Zuri   |         4          |
|   Farai Nia    |         4          |
|  Gamba Shani   |         3          |
| Jengo Tumaini  |         3          |
| Lalitha Kaburi |         7          |
|  Makena Thabo  |         3          |
| Malachi Mavuso |         21         |
|    Ona Sefu    |         1          |
+----------------+--------------------+
Truncated to displaylimit of 10.

Do you see a pattern there? Order the list if you can't see it yet.

It looks like some of our surveyors are making a lot of "mistakes" while many of the other surveyors are only making a few. I don't like where this is
going!

#### Gathering some evidence
Ok, so thinking about this a bit. How would we go about finding out if any of our employees are corrupt?

Let's say all employees make mistakes, if someone is corrupt, they will be making a lot of "mistakes", more than average, for example. But someone
could just be clumsy, so we should try to get more evidence...

Our auditor did say some of the things he heard on the streets were quite shady, and he recorded this in the statements column. Considering
both of these sources should give us a pretty reliable answer.

So let's try to find all of the employees who have an above-average number of mistakes. Let's break it down into steps first:
1. We have to first calculate the number of times someone's name comes up. (we just did that in the previous query). Let's call it error_count.
2. Then, we need to calculate the average number of mistakes employees made. We can do that by taking the average of the previous query's
results. Something like this:
SELECT
AVG(number_of_mistakes)
FROM
error_count;
Let's call that result avg_error_count_per_empl, which would be a scalar value.
3. Finaly we have to compare each employee's error_count with avg_error_count_per_empl. We will call this results set our suspect_list.
Remember that we can't use an aggregate result in WHERE, so we have to use avg_error_count_per_empl as a subquery.
SELECT
employee_name,
number_of_mistakes
FROM
error_count
WHERE
number_of_mistakes > (avg_error_count_per_empl);

#### 1.
Let's start by cleaning up our code a bit. First, Incorrect_records is a result we'll be using for the rest of the analysis, but it makes the
query a bit less readable. So, let's convert it to a VIEW. We can then use it as if it was a table. It will make our code much simpler to read, but, it
comes at a cost. We can add comments to CTEs in our code, so if we return to that query a year later, we can read those comments and quickly
understand what Incorrect_records represents. If we save it as a VIEW, it is not as obvious. So we should add comments in places where we
use Incorrect_records.

In [14]:
%%sql
-- So, replace WITH with CREATE VIEW like this,
-- and note that I added the statements column to this table in line 8 too:  PAGE(20)

CREATE VIEW Incorrect_records AS (
					SELECT
						auditor_report.location_id,
						visits.record_id,
						employee.employee_name,
						auditor_report.true_water_source_score AS auditor_score,
						wq.subjective_quality_score AS employee_score,
						auditor_report.statements AS statements
					FROM
						auditor_report
					JOIN
						visits
					ON 
                        auditor_report.location_id = visits.location_id
					JOIN
						water_quality AS wq
					ON 
						visits.record_id = wq.record_id
					JOIN
						employee
					ON 
						employee.assigned_employee_id = visits.assigned_employee_id
					WHERE
						visits.visit_count =1
					AND 
						auditor_report.true_water_source_score != wq.subjective_quality_score);

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

++
||
++
++

In [15]:
%%sql
select
    *
from
    Incorrect_records

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

102 rows affected.

+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | employee_score |                                                                                         statements                                                                                        |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |                                          Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                                          |
|  KiRu29290  |    7938   |  Bello Azibo   |       3       |       10       |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  KiHa22748  |   43140   |  Bello Azibo   |       9       |       10       |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  SoRu37841  |   18495   |   Rudo Imani   |       6       |       10       |                           The official's respectful and diligent presence was met with heartfelt appreciation, creating a sense of closeness with the villagers.                          |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
|  KiZu31170  |   17950   | Zuriel Matembo |       9       |       10       |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  KiZu31370  |   36864   | Yewande Ebele  |       3       |       10       |                                  With a keen understanding of urban challenges, the official's visit left a lasting impression of respect and commitment.                                 |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |                                    With humility and diligence, the official formed bonds with the villagers that felt like genuine family connections.                                   |
|  SoRu38331  |   13192   | Zuriel Matembo |       3       |       10       | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
+-------------+-----------+----------------+---------------+----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [16]:
%%sql
-- Next, we convert the query error_count, we made earlier, into a CTE.
-- Test it to make sure it gives the same result again, using SELECT * FROM
-- Incorrect_records. On large queries like this, it is better to build the query,
-- and test each step, because fixing errors becomes harder as the
-- query grows.  PAGE(21)

WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records
				GROUP BY
					employee_name)
-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

-- Query
SELECT
     *
FROM 
   error_count;

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

17 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|   Rudo Imani   |         5          |
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Yewande Ebele  |         3          |
| Jengo Tumaini  |         3          |
|   Farai Nia    |         4          |
| Malachi Mavuso |         21         |
|  Makena Thabo  |         3          |
| Lalitha Kaburi |         7          |
|  Gamba Shani   |         3          |
+----------------+--------------------+
Truncated to displaylimit of 10.

In [17]:
%%sql
-- 2. Now calculate the average of the number_of_mistakes in error_count. 
-- You should get a single value.  PAGE(21)

WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records
				GROUP BY
					employee_name)
-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

SELECT
     AVG(number_of_mistakes)     
FROM 
  error_count

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

1 rows affected.

+-------------------------+
| AVG(number_of_mistakes) |
+-------------------------+
|          6.0000         |
+-------------------------+

In [18]:
%%sql

 -- 3. To find the employees who made more mistakes than the average person,
    -- we need the employee's names, the number of mistakes each one
-- made, and filter the employees with an above-average number of mistakes.  PAGE(22)
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records
				GROUP BY
					employee_name)

-- Query
SELECT
     employee_name,
     number_of_mistakes
FROM 
   error_count
WHERE
    number_of_mistakes > 6
GROUP BY
    employee_name;
-- These are the employees who made more mistakes, on average, than their peers, 
-- so let's have a closer look at them.

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

4 rows affected.

+----------------+--------------------+
| employee_name  | number_of_mistakes |
+----------------+--------------------+
|  Bello Azibo   |         26         |
| Zuriel Matembo |         17         |
| Malachi Mavuso |         21         |
| Lalitha Kaburi |         7          |
+----------------+--------------------+

We should look at the Incorrect_records table again, and isolate all of the records these four employees gathered. We should also look at the
statements for these records to look for patterns.

#### First,
convert the suspect_list to a CTE, so we can use it to filter the records from these four employees. Make sure you get the names of the
four "suspects", and their mistake count as a result, using SELECT employee_name FROM suspect_list.

#### You should get a column of names back. So let's just recap here...
1. We use Incorrect_records to find all of the records where the auditor and employee scores don't match.
2. We then used error_count to aggregate the data, and got the number of mistakes each employee made.
3. Finally, suspect_list retrieves the data of employees who make an above-average number of mistakes.
Now we can filter that Incorrect_records CTE to identify all of the records associated with the four employees we identified

In [19]:
%%sql

-- Now we can filter that Incorrect_records CTE to identify all of the records
-- associated with the four employees we identified. PAGE(23)

WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records

-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

GROUP BY
	employee_name),
suspect_list AS (-- This CTE SELECTS the employees with above−average mistakes
			SELECT
				employee_name,
				number_of_mistakes
			FROM
				error_count
			WHERE
				number_of_mistakes > (SELECT 
										AVG(number_of_mistakes) 
									  FROM 
										error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
	employee_name,
	location_id,
	statements
FROM
	Incorrect_records
WHERE
	employee_name in (
					SELECT
                       employee_name 
                    FROM 
                       suspect_list);

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

71 rows affected.

+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                                         statements                                                                                        |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  Bello Azibo   |  KiRu29290  |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  Bello Azibo   |  KiHa22748  |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  Bello Azibo   |  KiRu27884  |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
| Zuriel Matembo |  KiZu31170  |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  Bello Azibo   |  AkRu06495  |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
| Zuriel Matembo |  SoRu38331  | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
| Malachi Mavuso |  AmAm09607  |       Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.      |
| Zuriel Matembo |  AkHa00314  |                                    A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products.                                    |
| Malachi Mavuso |  KiRu26598  |                                      A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her.                                     |
|  Bello Azibo   |  KiIs23853  |       Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.      |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

In [20]:
%%sql

WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records

-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

GROUP BY
	employee_name),
suspect_list AS (-- This CTE SELECTS the employees with above−average mistakes
			SELECT
				employee_name,
				number_of_mistakes
			FROM
				error_count
			WHERE
				number_of_mistakes > (SELECT 
										AVG(number_of_mistakes) 
									  FROM 
										error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
	employee_name,
	location_id,
	statements
FROM
	Incorrect_records
WHERE
	employee_name in (
					SELECT
                       employee_name 
                    FROM 
                       suspect_list);

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

71 rows affected.

+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                                         statements                                                                                        |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  Bello Azibo   |  KiRu29290  |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  Bello Azibo   |  KiHa22748  |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  Bello Azibo   |  KiRu27884  |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
| Zuriel Matembo |  KiZu31170  |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  Bello Azibo   |  AkRu06495  |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
| Zuriel Matembo |  SoRu38331  | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
| Malachi Mavuso |  AmAm09607  |       Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.      |
| Zuriel Matembo |  AkHa00314  |                                    A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products.                                    |
| Malachi Mavuso |  KiRu26598  |                                      A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her.                                     |
|  Bello Azibo   |  KiIs23853  |       Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.      |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

If you have a look, you will notice some alarming statements about these four officials (look at these records: AkRu04508, AkRu07310,
KiRu29639, AmAm09607, for example. See how the word "cash" is used a lot in these statements.

#### Filter the records that refer to "cash".

Let's just do one more check to make sure...

Check if there are any employees in the Incorrect_records table with statements mentioning "cash" that are not in our suspect list. This should
be as simple as adding one word.

I get an empty result, so no one, except the four suspects, has these allegations of bribery.

So we can sum up the evidence we have for Zuriel Matembo, Malachi Mavuso, Bello Azibo and Lalitha Kaburi:
1. They all made more mistakes than their peers on average.
2. They all have incriminating statements made against them, and only them.
Keep in mind, that this is not decisive proof, but it is concerning enough that we should flag it. Pres. Naledi has worked hard to stamp out
corruption, so she would urge us to report this.

# Questions of Integrated Project: Maji Ndogo Part 3

In [21]:
%%sql

-- Q1 
-- The following query results in 2,698 rows of data being retrieved, 
-- but the auditor_report table only has 1,620 rows. 
-- Analyse the query and select the reason why this discrepancy occurs. 
-- Hint: Think about the type of relationship between our tables.


SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    Empl_Table.employee_name,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score
FROM 
    auditor_report AS auditorRep
JOIN 
    visits AS visitsTbl
ON 
  auditorRep.location_id = visitsTbl.location_id
JOIN
   water_quality AS wq
ON 
  visitsTbl.record_id = wq.record_id
JOIN
   employee as Empl_Table
ON 
  Empl_Table.assigned_employee_id = visitsTbl.assigned_employee_id;
    
    
-- -----> ANSWER: The visits table has multiple records for each location_id,  
               -- which when joined with auditor_report, 
               -- results in multiple records for each location_id.

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

2698 rows affected.

+-------------+-----------+----------------+---------------+----------------+
| location_id | record_id | employee_name  | auditor_score | employee_score |
+-------------+-----------+----------------+---------------+----------------+
|  SoRu34980  |    5185   | Yewande Ebele  |       1       |       1        |
|  AkRu08112  |   59367   |   Pili Zola    |       3       |       3        |
|  AkLu02044  |   37379   | Sanaa Tendaji  |       0       |       0        |
|  AkHa00421  |   51627   |  Harith Nyota  |       3       |       3        |
|  SoRu35221  |   28758   | Malachi Mavuso |       0       |       0        |
|  HaAm16170  |   31048   |    Ona Sefu    |       1       |       1        |
|  AkRu04812  |    1513   |  Deka Osumare  |       3       |       3        |
|  AkRu08304  |    1218   | Sanaa Tendaji  |       3       |       3        |
|  AkRu05107  |    8322   | Jengo Tumaini  |       2       |       2        |
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |
+-------------+-----------+----------------+---------------+----------------+
Truncated to displaylimit of 10.

In [22]:
%%sql

-- Q2
-- What is the function of Incorrect_records in the following query?

WITH Incorrect_records AS ( -- This CTE fetches all of the records with wrong scores
SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    Empl_Table.employee_name,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score
FROM 
   auditor_report AS auditorRep
JOIN
   visits AS visitsTbl
ON 
  auditorRep.location_id = visitsTbl.location_id
JOIN
   water_quality AS wq
ON 
  visitsTbl.record_id = wq.record_id
JOIN
   employee as Empl_Table
ON 
  Empl_Table.assigned_employee_id = visitsTbl.assigned_employee_id
WHERE
  visitsTbl.visit_count =1
AND auditorRep.true_water_source_score != wq.subjective_quality_score)

SELECT
    employee_name,
    count(employee_name) AS Nunmber_of_Mistakes
FROM
    Incorrect_records
GROUP BY
     Employee_name;
-- -------------> ANSWER: Incorrect_records filters and organises records 
                       -- with different scores between auditor and employee, 
                       -- preparing a tailored dataset for the main query.

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

17 rows affected.

+----------------+---------------------+
| employee_name  | Nunmber_of_Mistakes |
+----------------+---------------------+
|   Rudo Imani   |          5          |
|  Bello Azibo   |          26         |
| Zuriel Matembo |          17         |
| Yewande Ebele  |          3          |
| Jengo Tumaini  |          3          |
|   Farai Nia    |          4          |
| Malachi Mavuso |          21         |
|  Makena Thabo  |          3          |
| Lalitha Kaburi |          7          |
|  Gamba Shani   |          3          |
+----------------+---------------------+
Truncated to displaylimit of 10.

In [23]:
%%sql

# WITH Q3


WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records

-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

GROUP BY
	employee_name),
suspect_list AS (-- This CTE SELECTS the employees with above−average mistakes
			SELECT
				employee_name,
				number_of_mistakes
			FROM
				error_count
			WHERE
				number_of_mistakes > (SELECT 
										AVG(number_of_mistakes) 
									  FROM 
										error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
	employee_name,
	location_id,
	statements
FROM
	Incorrect_records
WHERE
	employee_name in (
					SELECT
                       employee_name 
                    FROM 
                       suspect_list);

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

71 rows affected.

+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                                         statements                                                                                        |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  Bello Azibo   |  KiRu29290  |                                      A young artist sketches the faces in the queue, capturing the weariness of daily hours spent waiting for water.                                      |
|  Bello Azibo   |  KiHa22748  |                                            A young girl's hopeful eyes are clouded by mistrust, her innocence tarnished by the corrupt system.                                            |
|  Bello Azibo   |  KiRu27884  |                                           A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                          |
| Zuriel Matembo |  KiZu31170  |                                     A community leader stood with his people, expressing concern for the water quality and the time lost in queues.","                                    |
|  Bello Azibo   |  AkRu06495  |                                        A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                        |
| Zuriel Matembo |  SoRu38331  | An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts. |
| Malachi Mavuso |  AmAm09607  |       Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.      |
| Zuriel Matembo |  AkHa00314  |                                    A street vendor's sales suffer from time spent waiting, her concern for the water's quality affecting her products.                                    |
| Malachi Mavuso |  KiRu26598  |                                      A teenager's dreams are tempered by reality, her future threatened by the corrupt practices she sees around her.                                     |
|  Bello Azibo   |  KiIs23853  |       Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception.      |
+----------------+-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

%%sql

#### -- Q3
-- In the suspect_list CTE, a subquery is used. What type of subquery is it, and what is its purpose in the query?

suspect_list AS (
SELECT 
    employee_name,
    number_of_mistakes
FROM 
    error_count
WHERE 
    number_of_mistakes > (SELECT 
                             AVG(number_of_mistakes) 
                          FROM 
                             error_count))
##### ------> ANSWER: The subquery is a scalar subquery used to calculate the average number_of_mistakes for comparison.

%%sql

#### -- Q4
-- A colleague proposed the following CTE as an alternative to the suspect_list we used previously, but it does not give the desired results. What will be the result of this subquery?

suspect_list AS (
    SELECT
       ec1.employee_name, ec1.number_of_mistakes
    FROM 
       error_count ec1
    WHERE
        ec1.number_of_mistakes >= (
        SELECT
            AVG(ec2.number_of_mistakes)
        FROM
            error_count ec2
        WHERE
            ec2.employee_name = ec1.employee_name))
#### ----> ANSWER: The subquery is a correlated subquery that returns all of the employees that made errors.

#### -- Q5

How is the relationship between the employee table and the visits table represented in the ERD?

IF we look to ERD in MySql we will see this answer

#### ----> ANSWER: employee has a 1-to-many relationship with visits.

#### -- Q6

Which table contains the location_id as its primary key?


IF we look to ERD in MySql we will see this answer

#### ----> ANSWER: location

%%sql

#### -- Q7
-- How would you modify the Incorrect_records CTE to join the well_pollution data?

WITH Incorrect_records AS (
SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    Empl_Table.employee_name,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score,
    auditorRep.statements AS statements
FROM auditor_report AS auditorRep
JOIN visits AS visitsTbl
ON auditorRep.location_id = visitsTbl.location_id
JOIN water_quality AS wq
ON visitsTbl.record_id = wq.record_id
JOIN employee as Empl_Table
ON Empl_Table.assigned_employee_id = visitsTbl.assigned_employee_id
WHERE visitsTbl.visit_count = 1 AND auditorRep.true_water_source_score != wq.subjective_quality_score)

#### this query will give error in syntax but we can modify it

In [24]:
%%sql

# with Q7
# After modifying this syntax is true 

-- Q7
WITH Incorrect_records AS (
SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    Empl_Table.employee_name,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score,
    auditorRep.statements AS statements
FROM 
    auditor_report AS auditorRep
JOIN
    visits AS visitsTbl
ON 
    auditorRep.location_id = visitsTbl.location_id
JOIN
    water_quality AS wq
ON 
    visitsTbl.record_id = wq.record_id
JOIN
    employee as Empl_Table
ON 
    Empl_Table.assigned_employee_id = visitsTbl.assigned_employee_id
JOIN 
    well_pollution
ON
    visitsTbl.source_id = well_pollution.source_id
WHERE
    visitsTbl.visit_count =1 
AND 
    auditorRep.true_water_source_score != wq.subjective_quality_score)

SELECT
   *
FROM 
   Incorrect_records
#-- -------------> ANSWER: JOIN well_pollution ON visitsTbl.source_id = well_pollution.source_id

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

49 rows affected.

+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| location_id | record_id | employee_name  | auditor_score | employee_score |                                                                                   statements                                                                                   |
+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|  AkRu05215  |   21160   |   Rudo Imani   |       3       |       10       |                                    Villagers admired the official's visit for its respectful interactions, hard work, and genuine concern.                                     |
|  KiRu27884  |   33931   |  Bello Azibo   |       1       |       10       |                                     A traditional healer's empathy turns to bitterness, knowing that corrupt practices harm her community.                                     |
|  AkRu06495  |   45924   |  Bello Azibo   |       2       |       10       |                                  A healthcare worker in the queue expressed fears about water-borne diseases, her face etched with worry.","                                   |
|  HaRu17528  |   30524   | Jengo Tumaini  |       1       |       10       |                              With humility and diligence, the official formed bonds with the villagers that felt like genuine family connections.                              |
|  KiIs23853  |   55796   |  Bello Azibo   |       2       |       10       | Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception. |
|  AkRu03475  |   33630   |  Makena Thabo  |       1       |       10       |                       Villagers spoke highly of the official's humility and dedication, underscoring their respectful approach and familial connection.                        |
|  KiIs24083  |   28404   | Lalitha Kaburi |       2       |       10       |                                 A fisherman's anger boils beneath the surface, his livelihood threatened by the corrupt who tamper with water.                                 |
|  KiRu30343  |   51075   | Zuriel Matembo |       2       |       10       |                                 A university student's studies suffer from hours in line, dreams clouded by the daily reality of dirty water.                                  |
|  AkRu04116  |   53182   | Malachi Mavuso |       3       |       10       |                                A student's ambition is fueled by the daily water struggle, his determination to overcome evident in the queue.                                 |
|  SoRu37524  |   59640   |  Enitan Zuri   |       3       |       10       |                         Villagers held the official in high esteem, praising their dedication, respect, and the familial connections they established.                         |
+-------------+-----------+----------------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

#### Q8

In [25]:
%%sql

-- Q8
-- Which employee just avoided our classification of having an above-average number of mistakes? 
-- Hint: Use one of the queries we used to aggregate data from Incorrect_records.

WITH mistake_counts AS (
    SELECT
        employee_name,
        COUNT(*) AS total_mistakes
    FROM
        Incorrect_records
    GROUP BY
        employee_name
)

SELECT
    employee_name,
    AVG(total_mistakes) AS AVG_of_mistakes
FROM
    mistake_counts
GROUP BY
    employee_name
HAVING
    AVG(total_mistakes) = 5;
-- ------------------------------------> ANSWER: Rudo Imani
    
-- NOTE: AVGREGE(number_of_mistakes) = 6.00
-- NOTE: AVGREGE(number_of_mistakes) of Rudo Imani = 5.00

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

1 rows affected.

+---------------+-----------------+
| employee_name | AVG_of_mistakes |
+---------------+-----------------+
|   Rudo Imani  |      5.0000     |
+---------------+-----------------+

### Q9

Which of the following “suspects” is connected to the following civilian statement:
“Suspicion coloured villagers' descriptions of an official's aloof demeanour and apparent laziness. The reference to cash transactions casts doubt on their motives

### -- ------------------------------------> ANSWER: Lalitha Kaburi


#### Below is Justifying my Answer

In [26]:
%%sql

-- Q9 
WITH error_count AS ( -- This CTE calculates the number of mistakes each employee made
				SELECT
					employee_name,
					COUNT(employee_name) AS number_of_mistakes
				FROM
					Incorrect_records

-- Incorrect_records is a view that joins the audit report to the database
-- for records where the auditor and
-- employees scores are different*

GROUP BY
	employee_name),
suspect_list AS (-- This CTE SELECTS the employees with above−average mistakes
			SELECT
				employee_name,
				number_of_mistakes
			FROM
				error_count
			WHERE
				number_of_mistakes > (SELECT 
										AVG(number_of_mistakes) 
									  FROM 
										error_count))
-- This query filters all of the records where the "corrupt" employees gathered data.
SELECT
	employee_name,
	location_id,
	statements
FROM
	Incorrect_records
WHERE
	employee_name in (
					SELECT
                       employee_name 
                    FROM 
                       suspect_list)
AND 
   statements LIKE "%Suspicion colored villagers%"

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

1 rows affected.

+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employee_name  | location_id |                                                                            statements                                                                            |
+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Lalitha Kaburi |  KiRu29329  | Suspicion colored villagers' descriptions of an official's aloof demeanor and apparent laziness. The reference to cash transactions cast doubt on their motives. |
+----------------+-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+

#### Q10

In [27]:
%%sql

-- Q10

-- Consider the provided SQL query. What does it do?

SELECT
    auditorRep.location_id,
    visitsTbl.record_id,
    auditorRep.true_water_source_score AS auditor_score,
    wq.subjective_quality_score AS employee_score,
    wq.subjective_quality_score - auditorRep.true_water_source_score  AS score_diff
FROM 
    auditor_report AS auditorRep
JOIN 
    visits AS visitsTbl
ON 
    auditorRep.location_id = visitsTbl.location_id
JOIN 
    water_quality AS wq
ON 
   visitsTbl.record_id = wq.record_id
WHERE
    (wq.subjective_quality_score - auditorRep.true_water_source_score) > 9;

-- --------> ANSWER: The query retrieves the auditor records where employees 
                  -- assigned very high scores to very poor water sources.

Running query in 'mysql+pymysql://Explore:***@localhost:3306/mdd_water_services'

10 rows affected.

+-------------+-----------+---------------+----------------+------------+
| location_id | record_id | auditor_score | employee_score | score_diff |
+-------------+-----------+---------------+----------------+------------+
|  SoBa31691  |    3267   |       0       |       10       |     10     |
|  AkHa00363  |   25387   |       0       |       10       |     10     |
|  SoKo33094  |   16159   |       0       |       10       |     10     |
|  KiRu27364  |   38102   |       0       |       10       |     10     |
|  KiRu27065  |   29772   |       0       |       10       |     10     |
|  KiRu29147  |    3179   |       0       |       10       |     10     |
|  SoIl32770  |    7548   |       0       |       10       |     10     |
|  KiRu29329  |   11962   |       0       |       10       |     10     |
|  SoRu39544  |   17929   |       0       |       10       |     10     |
|  SoRu38535  |   44282   |       0       |       10       |     10     |
+-------------+-----------+---------------+----------------+------------+
Truncated to displaylimit of 10.

#  
<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>